=========================
change work

1、职业规划

2、结合业务


=========================

Manage

1、管理的核心 
向管理要效率
用最少的人最大的事情，

2、管理的思路
要尽量是从人治，专项标准、制度治理、五个角色
10人以上的团队一定要从人治，走向 标准治
人治的话，人就成了这个团队的瓶颈

3、管理的工具
用过的管理工具：KPI 像OKR 转化，员工由被动变主动

4、管理的结果
团队的文化、以及氛围：技术分享

5、管理的外延
管理要适当的有灰度
任正非说“水至清则无鱼”

6、管理 和 一线开发的思考
因为58用户量、业务的瓶颈，导致了技术上升存在的阻碍，需要有一个更大的平台锻炼自己的技术能力，出来也是主要想追求自己技术成长。如果团队能够提供管理的机会，我也有这样的储备，也能更好为团队出力。

==========================

Books

最近在看的书

1、贝佐斯的商业帝国
提到：
公司核心 人才（人才占比）
提供人才发挥的制度
可量化的评估系统 ，建立 数据指标体系
正飞轮，降低团队的殇（有序性，不要杂乱无章）

那我们看**为什么能发展的这么快，我认为是人才是核心，从BAT过来很多人才。制度，企业文化

CEO，全世界做得最好的企业做成什么样子，不闭门造车，站在未来，思考问题不要局限在现在

2、原则
瑞达利欧，桥水基金创始人，美国最大的私募基金创始人
及时总结，方便复用

3、飞轮效应
吉姆·柯林斯 麦肯锡公司
每家公司都能够通过借鉴成功企业的飞轮，挖掘出自身的经营优势，建立自己公司的飞轮，并通过长期持续的坚持，产生“飞轮效应”，帮助企业持续增长。

（高效能人士的七个习惯、以奋斗者为本）

技术上：
设计模式
团队人员配备，从T5 - T6，必须要大型架构设计能力


前端之外的领域：
区块链
python学习


========================