=========================

排序算法

冒泡

选择

快排

==========================

字符串

num.toString(2) 将一个数字转换为二进制

闰年：
（year % 4 == 0 && year % 100 ！== 0） ||（year % 400 === 0）

获取所有字符串

for( let i = 0 ; i < str.length ; i++ ){
  for(let j = i ; j < str.length ; j++){
    let temp = str.slice(i , j + 1)
  }
}

==========================

数组：

牛客网：
let arr = readline()
arr = arr.split(",").map((item) => parseInt(item))


==========================

链表

链表反转

两数相加

多个升序列表合并

链表排序

链表是否有环

链表相交

==========================


二叉树

满二叉树

完全二叉树

搜索二叉树

==========================

存储

Redis  缓存穿透、缓存击穿、缓存雪崩
5种数据类型

HBase的架构 
基于zookeepr操作的HDFS
布隆过滤器

mysql