怎么 保证交付质量 交付效率

// 流程优化 ci cd 能用自动化解决的问题，都用自动化解决，不要人工手动处理
// 比如之前项目上线
// igit分支管理，codereview等
//  项目管理 排期预留buffer, 制定关键时间节点，有问题及时反馈，协调资源
绩效沟通
// 需求饱和度
// 千行bug率
// 项目之外的微创新，基建等
// 合作部门的反馈情况等

1、管理的核心 
向管理要效率
用最少的人最大的事情，

2、管理的思路
要尽量是从人治，专项标准、制度治理、五个角色
10人以上的团队一定要从人治，走向 标准治
人治的话，人就成了这个团队的瓶颈

3、管理的工具
用过的管理工具：KPI 像OKR 转化，员工由被动变主动

4、管理的结果
团队的文化、以及氛围：技术分享

5、管理的外延
管理要适当的有灰度
任正非说“水至清则无鱼”

6、管理 和 一线开发的思考
因为58用户量、业务的瓶颈，导致了技术上升存在的阻碍，
需要有一个更大的平台锻炼自己的技术能力，出来也是主要想追求自己技术成长
。如果团队能够提供管理的机会，我也有这样的储备，也能更好为团队出力。